tap "arl/arl"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask.git"
tap "homebrew/cask-drivers", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-drivers.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-versions.git"
tap "homebrew/command-not-found", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-command-not-found.git"
tap "homebrew/core", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git"
tap "homebrew/services", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-services.git"
tap "riscv/riscv"
tap "romkatv/powerlevel10k"
brew "abseil"
brew "ansifilter"
brew "libssh2"
brew "aria2"
brew "python@3.11"
brew "autojump"
brew "bash"
brew "bat"
brew "bat-extras"
brew "protobuf"
brew "grpc"
brew "bear"
brew "boost"
brew "gcc"
brew "btop"
brew "fontconfig"
brew "glib"
brew "catimg"
brew "librsvg"
brew "chafa"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "libidn2"
brew "curl"
brew "delve"
brew "docker"
brew "duf"
brew "dust"
brew "eigen"
brew "libgit2"
brew "exa"
brew "fd"
brew "fzf"
brew "gawk"
brew "gdb"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "unbound"
brew "gnutls"
brew "go"
brew "guile"
brew "htop"
brew "jq"
brew "krb5"
brew "lazydocker"
brew "lazygit"
brew "libomp", link: true
brew "libssh"
brew "qemu"
brew "lima"
brew "llvm"
brew "lnav"
brew "lsd"
brew "lua"
brew "lua-language-server"
brew "luarocks"
brew "macchina"
brew "micromamba"
brew "ncdu"
brew "neovim"
brew "ninja"
brew "node@16"
brew "pipx"
brew "powerlevel10k"
brew "procs"
brew "python@3.8"
brew "python@3.9"
brew "qt"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "shellcheck"
brew "speedtest-cli"
brew "squirrel", link: false
brew "starship"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tomcat@8"
brew "trash"
brew "tree"
brew "unar"
brew "vim", link: false
brew "wget"
brew "yadm"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "heroku/brew/heroku"
brew "riscv/riscv/riscv-tools"
cask "android-file-transfer"
cask "betterdisplay"
cask "easydict"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
cask "iina"
cask "keepassxc"
cask "keycastr"
cask "macdown"
cask "macfuse"
cask "orbstack"
cask "squirrel"
cask "v2rayx"
vscode "13xforever.language-x86-64-assembly"
vscode "akamud.vscode-theme-onelight"
vscode "asciidoctor.asciidoctor-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "cschlosser.doxdocgen"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hars.cppsnippets"
vscode "ionutvmi.path-autocomplete"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "kriegalex.vscode-cudacpp"
vscode "lanza.lldb-vscode"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "octref.vetur"
vscode "peterj.proto"
vscode "redhat.vscode-yaml"
vscode "shan.code-settings-sync"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sumneko.lua"
vscode "techer.open-in-browser"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "xaver.clang-format"
vscode "yaamaa.disable-mouse"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
